/***********************************
 任务：定义自己的中断服务程序
 团队：首安六队
 时间：2015,01,08
***********************************/
#include "include.h"


/*******************************
函数名称：PIT0_IRQHandler
功能说明：PIT0 定时中断服务函数
*******************************/
void PIT0_IRQHandler(void)             //舵机控制
{               
     
    PIT_Flag_Clear(PIT0);             //清中断标志位 

}
//void USART1_IRQHandler()          //串口1 中断接收函数
//{
     
//}
/*********************************
 函数名称：PORTA_IRQHandler
 功能说明：PORTA端口中断服务函数
 起跑检测
**********************************/
/* 
void PORTA_IRQHandler()
{
    u8  n=0;      //引脚号   
    n=0;
    
    if(PORTA_ISFR & (1<<n))             //PTA0触发中断
    {
        PORTA_ISFR  |= (1<<n);          //写1清中断标志位            
    }       
}
 
*/




